// написать цикл for, который повторится 10 раз

for (let i = 0; i <= 9; i++) {
    console.log('Hello, Intocode')
}

// написать цикл который повторится миллион раз

/* for (let i = 0; i <= 999999; i++) {
     console.log('Hello, Intocode')
 } */

// Ниже напиши цикл for, который выведет в консоль числа от 0 до 100.

for (let i = 0; i <= 100; i++) {
    console.log(i);
}

// Ниже напиши цикл for, который выведет в консоль числа от 500 до 1000.

for (let i = 500; i <= 1000; i++) {
    console.log(i)
}

// Ниже напиши цикл for, который выведет в консоль числа от 1000 до 0.

for (let i = 1000; i >= 0; i--) {
    console.log(i)
}